docs/hoverfly/bsf_data/credit_card/transactions/reqCreditCardTransactionInquiry_PAN_D668FEC94E72F244D0C.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <CreditCardTransactionInquiryRequest xmlns="http://ws.core.cortex.com/domain/services/ccsitinq" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <RequestHeader xmlns="http://ws.core.cortex.com/domain/common/reqhdr">
    <Version>1.0.0</Version>
    <MsgUid>3c50f1c8-f30c-473f-bc22-96379bd80a8d</MsgUid>
    <Source>MBK</Source>
    <ServiceId>CreditCardTransactionInq</ServiceId>
    <ReqDateTime>2022-08-17-02:26:29:902</ReqDateTime>
  </RequestHeader>
  <CreditCardTransactionInquiryRequestDetails>
    <CardIdentifier xmlns="http://ws.core.cortex.com/domain/id/cardId">
      <Pan>D668FEC94E72F244D0C</Pan>
    </CardIdentifier>
    <!-- the PAN field supported both clear and encrypted card number -->
    <SearchLevel>0</SearchLevel>
    <!-- Search Level field handles 3 values:
        0: the transactions that will be retirieved are the ones linked to the card or account specified
        1: the transactions posted on the default card account will be retrieved
        2: the transactions posted on all the card accounts will be retrieved -->
    <PageSetup>
      <PageSize xmlns="http://ws.core.cortex.com/domain/types">1000</PageSize>
      <PageNumber xmlns="http://ws.core.cortex.com/domain/types">1</PageNumber>
      <ReturnCount xmlns="http://ws.core.cortex.com/domain/types">true</ReturnCount>
    </PageSetup>
    <SearchFilter>
      <TransactionDateRange>
        <DateFrom xmlns="http://ws.core.cortex.com/domain/types">2022-08-01</DateFrom>
        <DateTo xmlns="http://ws.core.cortex.com/domain/types">2022-08-31</DateTo>
      </TransactionDateRange>
      <PostedFlag>true</PostedFlag>
    </SearchFilter>
  </CreditCardTransactionInquiryRequestDetails>
</CreditCardTransactionInquiryRequest>
    </s:Body>
</s:Envelope>